# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух
# целых неотрицательных чисел. Из всех арифметических операций 
# допускаются только +1 и -1. Также нельзя использовать циклы.
# Пример: 2 2 -> 4
 
a = int(input("Введите первое положительное число a: "))
b = int(input("Введите второе положительное число b: "))

def sum(number_1  , number_2):
    if number_1 < 0 or number_2 < 0:
        return 'Введены некорректные числа'
    elif number_1 == 0:
        return number_2
    return sum(number_1 - 1, number_2 + 1)

print(sum(a, b))